openshwprojects/OpenBK7231T_App/platforms/W800/override/sdk/OpenW800/src/bt/host/stack/include/avrc_defs.h
#define AVRC_IS_VALID_BATTERY_STATUS(a)    ((a <= AVRC_BATTERY_STATUS_FULL_CHARGE) ? TRUE : FALSE)

#define AVRC_IS_VALID_SYSTEM_STATUS(a)    ((a <= AVRC_SYSTEMSTATE_PWR_UNPLUGGED) ? TRUE : FALSE)

#define AVRC_IS_VALID_GROUP(a)    ((a <= AVRC_PDU_PREV_GROUP) ? TRUE : FALSE)

/* Company ID is 24-bit integer We can not use the macros in bt_types.h */
#define AVRC_CO_ID_TO_BE_STREAM(p, u32) {*(p)++ = (uint8_t)((u32) >> 16); *(p)++ = (uint8_t)((u32) >> 8); *(p)++ = (uint8_t)(u32); }
#define AVRC_BE_STREAM_TO_CO_ID(u32, p) {u32 = (((uint32_t)(*((p) + 2))) + (((uint32_t)(*((p) + 1))) << 8) + (((uint32_t)(*(p))) << 16)); (p) += 3;}

/*****************************************************************************
**  data type definitions
*****************************************************************************/
#define AVRC_MAX_APP_ATTR_SIZE      16
#define AVRC_MAX_CHARSET_SIZE       16
#define AVRC_MAX_ELEM_ATTR_SIZE     8

/*****************************************************************************
**  Metadata transfer Building/Parsing definitions
*****************************************************************************/

typedef struct {
    uint16_t              charset_id;
    uint16_t              str_len;
    uint8_t               *p_str;
} tAVRC_FULL_NAME;

typedef struct {
    uint16_t              str_len;
    uint8_t               *p_str;
} tAVRC_NAME;

#ifndef AVRC_CAP_MAX_NUM_COMP_ID
#define AVRC_CAP_MAX_NUM_COMP_ID    4
#endif

#ifndef AVRC_CAP_MAX_NUM_EVT_ID
#define AVRC_CAP_MAX_NUM_EVT_ID     16
#endif

typedef union {
    uint32_t  company_id[AVRC_CAP_MAX_NUM_COMP_ID];
    uint8_t   event_id[AVRC_CAP_MAX_NUM_EVT_ID];
} tAVRC_CAPS_PARAM;

typedef struct {
    uint8_t   attr_id;
    uint8_t   attr_val;
} tAVRC_APP_SETTING;

typedef struct {
    uint8_t   attr_id;
    uint16_t  charset_id;
    uint8_t   str_len;
    uint8_t   *p_str;
} tAVRC_APP_SETTING_TEXT;

typedef uint8_t tAVRC_FEATURE_MASK[AVRC_FEATURE_MASK_SIZE];

typedef struct {
    uint16_t              player_id;      /* A unique identifier for this media player.*/
    uint8_t
    major_type;     /* Use AVRC_MJ_TYPE_AUDIO, AVRC_MJ_TYPE_VIDEO, AVRC_MJ_TYPE_BC_AUDIO, or AVRC_MJ_TYPE_BC_VIDEO.*/
    uint32_t
    sub_type;       /* Use AVRC_SUB_TYPE_NONE, AVRC_SUB_TYPE_AUDIO_BOOK, or AVRC_SUB_TYPE_PODCAST*/
    uint8_t
    play_status;    /* Use AVRC_PLAYSTATE_STOPPED, AVRC_PLAYSTATE_PLAYING, AVRC_PLAYSTATE_PAUSED, AVRC_PLAYSTATE_FWD_SEEK,
                                            AVRC_PLAYSTATE_REV_SEEK, or AVRC_PLAYSTATE_ERROR*/
    tAVRC_FEATURE_MASK  features;       /* Supported feature bit mask*/
    tAVRC_FULL_NAME     name;           /* The player name, name length and character set id.*/
} tAVRC_ITEM_PLAYER;

typedef struct {
    tAVRC_UID           uid;            /* The uid of this folder */
    uint8_t               type;           /* Use AVRC_FOLDER_TYPE_MIXED, AVRC_FOLDER_TYPE_TITLES,
                                           AVRC_FOLDER_TYPE_ALNUMS, AVRC_FOLDER_TYPE_ARTISTS, AVRC_FOLDER_TYPE_GENRES,
                                           AVRC_FOLDER_TYPE_PLAYLISTS, or AVRC_FOLDER_TYPE_YEARS.*/
    uint8_t             playable;       /* TRUE, if the folder can be played. */
    tAVRC_FULL_NAME     name;           /* The folder name, name length and character set id. */
} tAVRC_ITEM_FOLDER;

typedef struct {
    uint32_t
    attr_id;        /* Use AVRC_MEDIA_ATTR_ID_TITLE, AVRC_MEDIA_ATTR_ID_ARTIST, AVRC_MEDIA_ATTR_ID_ALBUM,
                                           AVRC_MEDIA_ATTR_ID_TRACK_NUM, AVRC_MEDIA_ATTR_ID_NUM_TRACKS,
                                           AVRC_MEDIA_ATTR_ID_GENRE, AVRC_MEDIA_ATTR_ID_PLAYING_TIME */
    tAVRC_FULL_NAME     name;           /* The attribute value, value length and character set id. */
} tAVRC_ATTR_ENTRY;

typedef struct {
    tAVRC_UID           uid;            /* The uid of this media element item */
    uint8_t               type;           /* Use AVRC_MEDIA_TYPE_AUDIO or AVRC_MEDIA_TYPE_VIDEO. */
    tAVRC_FULL_NAME     name;           /* The media name, name length and character set id. */
    uint8_t               attr_count;     /* The number of attributes in p_attr_list */
    tAVRC_ATTR_ENTRY   *p_attr_list;    /* Attribute entry list. */
} tAVRC_ITEM_MEDIA;

typedef struct {
    uint8_t                   item_type;  /* AVRC_ITEM_PLAYER, AVRC_ITEM_FOLDER, or AVRC_ITEM_MEDIA */
    union {
        tAVRC_ITEM_PLAYER   player;     /* The properties of a media player item.*/
        tAVRC_ITEM_FOLDER   folder;     /* The properties of a folder item.*/
        tAVRC_ITEM_MEDIA    media;      /* The properties of a media item.*/
    } u;
} tAVRC_ITEM;

/* GetCapability */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       capability_id;
} tAVRC_GET_CAPS_CMD;

/* ListPlayerAppValues */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       attr_id;
} tAVRC_LIST_APP_VALUES_CMD;

/* GetCurAppValue */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       num_attr;
    uint8_t       attrs[AVRC_MAX_APP_ATTR_SIZE];
} tAVRC_GET_CUR_APP_VALUE_CMD;

/* SetAppValue */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       num_val;
    tAVRC_APP_SETTING   *p_vals;
} tAVRC_SET_APP_VALUE_CMD;

/* GetAppAttrTxt */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       num_attr;
    uint8_t       attrs[AVRC_MAX_APP_ATTR_SIZE];
} tAVRC_GET_APP_ATTR_TXT_CMD;

/* GetAppValueTxt */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       attr_id;
    uint8_t       num_val;
    uint8_t       vals[AVRC_MAX_APP_ATTR_SIZE];
} tAVRC_GET_APP_VAL_TXT_CMD;

/* InformCharset */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       num_id;
    uint16_t      charsets[AVRC_MAX_CHARSET_SIZE];
} tAVRC_INFORM_CHARSET_CMD;

/* InformBatteryStatus */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       battery_status;
} tAVRC_BATTERY_STATUS_CMD;

/* GetElemAttrs */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       num_attr;
    uint32_t      attrs[AVRC_MAX_ELEM_ATTR_SIZE];
} tAVRC_GET_ELEM_ATTRS_CMD;

