openshwprojects/OpenBK7231T_App/platforms/W800/override/sdk/OpenW800/src/bt/host/stack/include/avrc_defs.h
/* RegNotify */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       event_id;
    uint32_t      param;
} tAVRC_REG_NOTIF_CMD;

/* SetAddrPlayer */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint16_t      player_id;
} tAVRC_SET_ADDR_PLAYER_CMD;

/* SetBrowsedPlayer */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint16_t      player_id;
} tAVRC_SET_BR_PLAYER_CMD;

/* SetAbsVolume */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       volume;
} tAVRC_SET_VOLUME_CMD;

/* GetFolderItems */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       scope;
    uint32_t      start_item;
    uint32_t      end_item;
    uint8_t       attr_count;
    uint32_t      *p_attr_list;
} tAVRC_GET_ITEMS_CMD;

/* ChangePath */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint16_t      uid_counter;
    uint8_t       direction;
    tAVRC_UID   folder_uid;
} tAVRC_CHG_PATH_CMD;

/* GetItemAttrs */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       scope;
    tAVRC_UID   uid;
    uint16_t      uid_counter;
    uint8_t       attr_count;
    uint32_t      *p_attr_list;
} tAVRC_GET_ATTRS_CMD;

/* Search */
typedef struct {
    uint8_t           pdu;
    tAVRC_STS       status;
    uint8_t           opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    tAVRC_FULL_NAME string;
} tAVRC_SEARCH_CMD;

/* PlayItem */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       scope;
    tAVRC_UID   uid;
    uint16_t      uid_counter;
} tAVRC_PLAY_ITEM_CMD;

/* AddToNowPlaying */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       scope;
    tAVRC_UID   uid;
    uint16_t      uid_counter;
} tAVRC_ADD_TO_PLAY_CMD;

typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
} tAVRC_CMD;

/* Continue and Abort */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t       opcode;         /* Op Code (assigned by AVRC_BldCommand according to pdu) */
    uint8_t       target_pdu;
} tAVRC_NEXT_CMD;

typedef union {
    uint8_t                       pdu;
    tAVRC_CMD                   cmd;
    tAVRC_GET_CAPS_CMD          get_caps;               /* GetCapability */
    tAVRC_CMD                   list_app_attr;          /* ListPlayerAppAttr */
    tAVRC_LIST_APP_VALUES_CMD   list_app_values;        /* ListPlayerAppValues */
    tAVRC_GET_CUR_APP_VALUE_CMD get_cur_app_val;        /* GetCurAppValue */
    tAVRC_SET_APP_VALUE_CMD     set_app_val;            /* SetAppValue */
    tAVRC_GET_APP_ATTR_TXT_CMD  get_app_attr_txt;       /* GetAppAttrTxt */
    tAVRC_GET_APP_VAL_TXT_CMD   get_app_val_txt;        /* GetAppValueTxt */
    tAVRC_INFORM_CHARSET_CMD    inform_charset;         /* InformCharset */
    tAVRC_BATTERY_STATUS_CMD    inform_battery_status;  /* InformBatteryStatus */
    tAVRC_GET_ELEM_ATTRS_CMD    get_elem_attrs;         /* GetElemAttrs */
    tAVRC_CMD                   get_play_status;        /* GetPlayStatus */
    tAVRC_REG_NOTIF_CMD         reg_notif;              /* RegNotify */
    tAVRC_NEXT_CMD              continu;                /* Continue */
    tAVRC_NEXT_CMD              abort;                  /* Abort */

    tAVRC_SET_ADDR_PLAYER_CMD   addr_player;            /* SetAddrPlayer */
    tAVRC_SET_VOLUME_CMD        volume;                 /* SetAbsVolume */
    tAVRC_SET_BR_PLAYER_CMD     br_player;              /* SetBrowsedPlayer */
    tAVRC_GET_ITEMS_CMD         get_items;              /* GetFolderItems */
    tAVRC_CHG_PATH_CMD          chg_path;               /* ChangePath */
    tAVRC_GET_ATTRS_CMD         get_attrs;              /* GetItemAttrs */
    tAVRC_SEARCH_CMD            search;                 /* Search */
    tAVRC_PLAY_ITEM_CMD         play_item;              /* PlayItem */
    tAVRC_ADD_TO_PLAY_CMD       add_to_play;            /* AddToNowPlaying */
} tAVRC_COMMAND;

/* GetCapability */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t
    opcode;         /* Op Code (copied from avrc_cmd.opcode by AVRC_BldResponse user. invalid one to generate according to pdu) */
    uint8_t       capability_id;
    uint8_t       count;
    tAVRC_CAPS_PARAM param;
} tAVRC_GET_CAPS_RSP;

/* ListPlayerAppAttr */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t
    opcode;         /* Op Code (copied from avrc_cmd.opcode by AVRC_BldResponse user. invalid one to generate according to pdu) */
    uint8_t       num_attr;
    uint8_t       attrs[AVRC_MAX_APP_ATTR_SIZE];
} tAVRC_LIST_APP_ATTR_RSP;

/* ListPlayerAppValues */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t
    opcode;         /* Op Code (copied from avrc_cmd.opcode by AVRC_BldResponse user. invalid one to generate according to pdu) */
    uint8_t       num_val;
    uint8_t       vals[AVRC_MAX_APP_ATTR_SIZE];
} tAVRC_LIST_APP_VALUES_RSP;

/* GetCurAppValue */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t
    opcode;         /* Op Code (copied from avrc_cmd.opcode by AVRC_BldResponse user. invalid one to generate according to pdu) */
    uint8_t       num_val;
    tAVRC_APP_SETTING   *p_vals;
} tAVRC_GET_CUR_APP_VALUE_RSP;

/* GetAppAttrTxt */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t
    opcode;         /* Op Code (copied from avrc_cmd.opcode by AVRC_BldResponse user. invalid one to generate according to pdu) */
    uint8_t       num_attr;
    tAVRC_APP_SETTING_TEXT   *p_attrs;
} tAVRC_GET_APP_ATTR_TXT_RSP;

/* GetElemAttrs */
typedef struct {
    uint8_t       pdu;
    tAVRC_STS   status;
    uint8_t
    opcode;         /* Op Code (copied from avrc_cmd.opcode by AVRC_BldResponse user. invalid one to generate according to pdu) */
    uint8_t       num_attr;
    tAVRC_ATTR_ENTRY   *p_attrs;
} tAVRC_GET_ELEM_ATTRS_RSP;

